evidence/OPS-2203/after/k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2203.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * admissions_surge: 500 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 167 complete and 0 interrupted iterations
admissions_surge   [   3% ] 500 VUs  01.0s/30s

running (0m02.0s), 500/500 VUs, 831 complete and 0 interrupted iterations
admissions_surge   [   7% ] 500 VUs  02.0s/30s

running (0m03.0s), 500/500 VUs, 1487 complete and 0 interrupted iterations
admissions_surge   [  10% ] 500 VUs  03.0s/30s

running (0m04.0s), 500/500 VUs, 2093 complete and 0 interrupted iterations
admissions_surge   [  13% ] 500 VUs  04.0s/30s

running (0m05.0s), 500/500 VUs, 2836 complete and 0 interrupted iterations
admissions_surge   [  17% ] 500 VUs  05.0s/30s

running (0m06.0s), 500/500 VUs, 3436 complete and 0 interrupted iterations
admissions_surge   [  20% ] 500 VUs  06.0s/30s

running (0m07.0s), 500/500 VUs, 4206 complete and 0 interrupted iterations
admissions_surge   [  23% ] 500 VUs  07.0s/30s

running (0m08.0s), 500/500 VUs, 4887 complete and 0 interrupted iterations
admissions_surge   [  27% ] 500 VUs  08.0s/30s

running (0m09.0s), 500/500 VUs, 5560 complete and 0 interrupted iterations
admissions_surge   [  30% ] 500 VUs  09.0s/30s

running (0m10.0s), 500/500 VUs, 6050 complete and 0 interrupted iterations
admissions_surge   [  33% ] 500 VUs  10.0s/30s

running (0m11.0s), 500/500 VUs, 6733 complete and 0 interrupted iterations
admissions_surge   [  37% ] 500 VUs  11.0s/30s

running (0m12.0s), 500/500 VUs, 7411 complete and 0 interrupted iterations
admissions_surge   [  40% ] 500 VUs  12.0s/30s

running (0m13.0s), 500/500 VUs, 8166 complete and 0 interrupted iterations
admissions_surge   [  43% ] 500 VUs  13.0s/30s

running (0m14.0s), 500/500 VUs, 8638 complete and 0 interrupted iterations
admissions_surge   [  47% ] 500 VUs  14.0s/30s

running (0m15.0s), 500/500 VUs, 9007 complete and 0 interrupted iterations
admissions_surge   [  50% ] 500 VUs  15.0s/30s

running (0m16.0s), 500/500 VUs, 9370 complete and 0 interrupted iterations
admissions_surge   [  53% ] 500 VUs  16.0s/30s

running (0m17.0s), 500/500 VUs, 9952 complete and 0 interrupted iterations
admissions_surge   [  57% ] 500 VUs  17.0s/30s

running (0m18.0s), 500/500 VUs, 10635 complete and 0 interrupted iterations
admissions_surge   [  60% ] 500 VUs  18.0s/30s

running (0m19.0s), 500/500 VUs, 11321 complete and 0 interrupted iterations
admissions_surge   [  63% ] 500 VUs  19.0s/30s

running (0m20.0s), 500/500 VUs, 11989 complete and 0 interrupted iterations
admissions_surge   [  67% ] 500 VUs  20.0s/30s

running (0m21.0s), 500/500 VUs, 12685 complete and 0 interrupted iterations
admissions_surge   [  70% ] 500 VUs  21.0s/30s

running (0m22.0s), 500/500 VUs, 13373 complete and 0 interrupted iterations
admissions_surge   [  73% ] 500 VUs  22.0s/30s

running (0m23.0s), 500/500 VUs, 13919 complete and 0 interrupted iterations
admissions_surge   [  77% ] 500 VUs  23.0s/30s

running (0m24.0s), 500/500 VUs, 14585 complete and 0 interrupted iterations
admissions_surge   [  80% ] 500 VUs  24.0s/30s

running (0m25.0s), 500/500 VUs, 15245 complete and 0 interrupted iterations
admissions_surge   [  83% ] 500 VUs  25.0s/30s

running (0m26.0s), 500/500 VUs, 15868 complete and 0 interrupted iterations
admissions_surge   [  87% ] 500 VUs  26.0s/30s

running (0m27.0s), 500/500 VUs, 16569 complete and 0 interrupted iterations
admissions_surge   [  90% ] 500 VUs  27.0s/30s

running (0m28.0s), 500/500 VUs, 17235 complete and 0 interrupted iterations
admissions_surge   [  93% ] 500 VUs  28.0s/30s

running (0m29.0s), 500/500 VUs, 17968 complete and 0 interrupted iterations
admissions_surge   [  97% ] 500 VUs  29.0s/30s

running (0m30.0s), 500/500 VUs, 18645 complete and 0 interrupted iterations
admissions_surge   [ 100% ] 500 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=1.19s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 19174   625.155258/s
    checks_succeeded...: 100.00% 19174 out of 19174
    checks_failed......: 0.00%   0 out of 19174

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=790.01ms min=604.38ms med=747.72ms max=1.58s p(90)=933.08ms p(95)=1.19s
      { expected_response:true }...: avg=790.01ms min=604.38ms med=747.72ms max=1.58s p(90)=933.08ms p(95)=1.19s
    http_req_failed................: 0.00%  0 out of 19174
    http_reqs......................: 19174  625.155258/s

    EXECUTION
    iteration_duration.............: avg=790.48ms min=604.43ms med=747.8ms  max=1.58s p(90)=933.39ms p(95)=1.19s
    iterations.....................: 19174  625.155258/s
    vus............................: 500    min=500        max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 5.2 MB 169 kB/s
    data_sent......................: 2.8 MB 91 kB/s



running (0m30.7s), 000/500 VUs, 19174 complete and 0 interrupted iterations
admissions_surge ✓ [ 100% ] 500 VUs  30s
time="2026-08-11T18:31:39+03:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"